# IPointCloudAccess Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPointCloudAccess Members
IPointCloudAccess Interface Methods See Also
---
The IPointCloudAccess type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreatePointSetIterator(PointCloudFilter, ElementId) | Implement this method to return an iterator for iterating over blocks of this point cloud. |
| CreatePointSetIterator(PointCloudFilter, Double, ElementId) | Implement this method to return an iterator for iterating over blocks of this point cloud. |
| Free | Completes the lifetime of the object providing this interface. |
| GetColorEncoding | Returns the encoding used by points in this point cloud. |
| GetExtent | Implement this method to returns an object that contains the bounding box of the entire point cloud, aligned to the point cloud coordinate system. |
| GetName | Implement this method to return the name of the point cloud that will be used when Revit needs to refer to the point cloud type, e.g. in the Manage Links dialog or in the Type Properties dialog. |
| GetOffset | Implement this method to return the offset stored in the point cloud. |
| GetUnitsToFeetConversionFactor | Implement this method to return the conversion factor from the units of the point cloud to feet. |
| ReadPoints | Implement this method so that on successive invocations it will return distinct subsets of points which meet the criterion. |

# See Also
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace